{"config": [{"config": {"dtype": "float32", "batch_input_shape": [null, 11, 1], "trainable": true, "kernel_regularizer": null, "implementation": 1, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "return_state": false, "go_backwards": false, "name": "lstm_1", "recurrent_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "unroll": false, "return_sequences": true, "dropout": 0.0, "unit_forget_bias": true, "stateful": false, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "activation": "tanh", "use_bias": true, "units": 50, "bias_regularizer": null, "recurrent_constraint": null, "recurrent_dropout": 0.0, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}}, "class_name": "LSTM"}, {"config": {"recurrent_constraint": null, "kernel_regularizer": null, "implementation": 1, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "return_state": false, "go_backwards": false, "name": "lstm_2", "units": 50, "recurrent_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "unroll": false, "return_sequences": false, "dropout": 0.0, "unit_forget_bias": true, "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "activation": "tanh", "use_bias": true, "stateful": false, "bias_regularizer": null, "trainable": true, "recurrent_dropout": 0.0, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}}, "class_name": "LSTM"}, {"config": {"name": "dense_1", "trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "activation": "linear", "use_bias": true, "bias_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 1}, "class_name": "Dense"}], "keras_version": "2.2.2", "class_name": "Sequential", "backend": "tensorflow"}