{"config": [{"config": {"implementation": 1, "dtype": "float32", "recurrent_constraint": null, "go_backwards": false, "recurrent_dropout": 0.0, "stateful": false, "unit_forget_bias": true, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "return_sequences": true, "kernel_constraint": null, "recurrent_regularizer": null, "batch_input_shape": [null, 11, 1], "unroll": false, "activation": "tanh", "bias_regularizer": null, "trainable": true, "units": 50, "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "return_state": false, "name": "lstm_1", "dropout": 0.0, "recurrent_activation": "hard_sigmoid"}, "class_name": "LSTM"}, {"config": {"unit_forget_bias": true, "recurrent_constraint": null, "go_backwards": false, "recurrent_dropout": 0.0, "stateful": false, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "dropout": 0.0, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "return_sequences": false, "kernel_constraint": null, "implementation": 1, "recurrent_regularizer": null, "activation": "tanh", "bias_regularizer": null, "trainable": true, "units": 50, "kernel_regularizer": null, "activity_regularizer": null, "use_bias": true, "return_state": false, "name": "lstm_2", "unroll": false, "recurrent_activation": "hard_sigmoid"}, "class_name": "LSTM"}, {"config": {"activation": "linear", "bias_regularizer": null, "trainable": true, "units": 1, "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "name": "dense_1", "use_bias": true}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.2.2"}