{"keras_version": "2.2.2", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"recurrent_constraint": null, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "return_state": false, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "dropout": 0.0, "bias_regularizer": null, "go_backwards": false, "activation": "tanh", "recurrent_regularizer": null, "dtype": "float32", "recurrent_activation": "hard_sigmoid", "unit_forget_bias": true, "name": "lstm_1", "unroll": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "implementation": 1, "stateful": false, "return_sequences": true, "units": 50, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_constraint": null, "batch_input_shape": [null, 11, 1], "recurrent_dropout": 0.0}}, {"class_name": "LSTM", "config": {"recurrent_constraint": null, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "return_state": false, "trainable": true, "units": 50, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "dropout": 0.0, "bias_regularizer": null, "go_backwards": false, "activation": "tanh", "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "unit_forget_bias": true, "name": "lstm_2", "unroll": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "implementation": 1, "stateful": false, "return_sequences": false, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "use_bias": true, "bias_constraint": null, "name": "dense_1", "kernel_regularizer": null, "activation": "linear", "trainable": true, "units": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}]}