{"keras_version": "2.2.2", "config": [{"config": {"kernel_constraint": null, "units": 50, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "return_state": false, "name": "lstm_1", "go_backwards": false, "kernel_regularizer": null, "dropout": 0.0, "unit_forget_bias": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "recurrent_regularizer": null, "dtype": "float32", "recurrent_constraint": null, "recurrent_dropout": 0.0, "trainable": true, "use_bias": true, "batch_input_shape": [null, 11, 1], "implementation": 1, "activity_regularizer": null, "stateful": false, "unroll": false, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "activation": "tanh", "bias_regularizer": null, "return_sequences": true}, "class_name": "LSTM"}, {"config": {"kernel_constraint": null, "units": 50, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "return_state": false, "name": "lstm_2", "go_backwards": false, "kernel_regularizer": null, "dropout": 0.0, "unit_forget_bias": true, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "recurrent_regularizer": null, "recurrent_constraint": null, "recurrent_dropout": 0.0, "trainable": true, "use_bias": true, "activation": "tanh", "implementation": 1, "activity_regularizer": null, "stateful": false, "return_sequences": false, "recurrent_activation": "hard_sigmoid", "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "bias_regularizer": null, "unroll": false}, "class_name": "LSTM"}, {"config": {"kernel_constraint": null, "trainable": true, "name": "dense_1", "units": 1, "use_bias": true, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "activity_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow"}