{"keras_version": "2.2.2", "config": [{"class_name": "LSTM", "config": {"recurrent_constraint": null, "activation": "tanh", "kernel_constraint": null, "bias_constraint": null, "implementation": 1, "batch_input_shape": [null, 11, 1], "stateful": false, "bias_regularizer": null, "go_backwards": false, "dtype": "float32", "recurrent_activation": "hard_sigmoid", "return_state": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unroll": false, "kernel_regularizer": null, "dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "unit_forget_bias": true, "trainable": true, "activity_regularizer": null, "recurrent_regularizer": null, "units": 50, "recurrent_dropout": 0.0, "return_sequences": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "name": "lstm_1"}}, {"class_name": "LSTM", "config": {"recurrent_constraint": null, "stateful": false, "kernel_constraint": null, "bias_constraint": null, "implementation": 1, "activation": "tanh", "bias_regularizer": null, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "return_state": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "unroll": false, "kernel_regularizer": null, "dropout": 0.0, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "unit_forget_bias": true, "trainable": true, "activity_regularizer": null, "recurrent_regularizer": null, "units": 50, "recurrent_dropout": 0.0, "return_sequences": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "name": "lstm_2"}}, {"class_name": "Dense", "config": {"bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "name": "dense_1", "activation": "linear", "bias_regularizer": null, "units": 1, "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}}}], "backend": "tensorflow", "class_name": "Sequential"}