{"backend": "tensorflow", "keras_version": "2.2.2", "config": [{"config": {"kernel_regularizer": null, "activity_regularizer": null, "name": "lstm_1", "recurrent_dropout": 0.0, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "units": 50, "return_sequences": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "unit_forget_bias": true, "dropout": 0.0, "return_state": false, "batch_input_shape": [null, 11, 1], "trainable": true, "recurrent_regularizer": null, "stateful": false, "kernel_constraint": null, "implementation": 1, "dtype": "float32", "use_bias": true, "go_backwards": false, "recurrent_constraint": null, "unroll": false, "activation": "tanh", "bias_regularizer": null}, "class_name": "LSTM"}, {"config": {"kernel_regularizer": null, "activity_regularizer": null, "stateful": false, "recurrent_dropout": 0.0, "bias_constraint": null, "recurrent_activation": "hard_sigmoid", "units": 50, "return_sequences": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "unit_forget_bias": true, "dropout": 0.0, "return_state": false, "go_backwards": false, "trainable": true, "recurrent_regularizer": null, "name": "lstm_2", "kernel_constraint": null, "implementation": 1, "use_bias": true, "recurrent_constraint": null, "unroll": false, "activation": "tanh", "bias_regularizer": null}, "class_name": "LSTM"}, {"config": {"kernel_regularizer": null, "bias_regularizer": null, "name": "dense_1", "kernel_constraint": null, "bias_constraint": null, "use_bias": true, "units": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "activation": "linear"}, "class_name": "Dense"}], "class_name": "Sequential"}