{"backend": "tensorflow", "keras_version": "2.2.2", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "dropout": 0.0, "go_backwards": false, "use_bias": true, "dtype": "float32", "return_state": false, "recurrent_constraint": null, "recurrent_dropout": 0.0, "unroll": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "implementation": 1, "activity_regularizer": null, "activation": "tanh", "stateful": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "trainable": true, "bias_regularizer": null, "batch_input_shape": [null, 11, 1], "unit_forget_bias": true, "return_sequences": true, "name": "lstm_1", "recurrent_regularizer": null, "kernel_regularizer": null, "units": 50, "recurrent_activation": "hard_sigmoid", "bias_constraint": null}}, {"class_name": "LSTM", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "dropout": 0.0, "name": "lstm_2", "use_bias": true, "implementation": 1, "return_state": false, "recurrent_regularizer": null, "recurrent_dropout": 0.0, "unroll": false, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "go_backwards": false, "activity_regularizer": null, "activation": "tanh", "stateful": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "trainable": true, "bias_regularizer": null, "unit_forget_bias": true, "return_sequences": false, "kernel_regularizer": null, "recurrent_constraint": null, "units": 50, "recurrent_activation": "hard_sigmoid", "bias_constraint": null}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "name": "dense_1", "activity_regularizer": null, "use_bias": true, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "trainable": true, "bias_regularizer": null, "kernel_regularizer": null, "units": 1, "bias_constraint": null}}]}