{"config": [{"config": {"name": "lstm_1", "unroll": false, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "dropout": 0.0, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "recurrent_dropout": 0.0, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "stateful": false, "recurrent_regularizer": null, "activation": "tanh", "trainable": true, "use_bias": true, "unit_forget_bias": true, "return_sequences": true, "bias_constraint": null, "implementation": 1, "kernel_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "activity_regularizer": null, "units": 50, "batch_input_shape": [null, 10, 1], "return_state": false}, "class_name": "LSTM"}, {"config": {"name": "lstm_2", "unroll": false, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "dropout": 0.0, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "recurrent_dropout": 0.0, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "stateful": false, "recurrent_regularizer": null, "activation": "tanh", "trainable": true, "use_bias": true, "unit_forget_bias": true, "return_sequences": false, "bias_constraint": null, "implementation": 1, "kernel_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "activity_regularizer": null, "units": 50, "return_state": false}, "class_name": "LSTM"}, {"config": {"name": "dense_1", "units": 1, "bias_regularizer": null, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "trainable": true, "activation": "linear"}, "class_name": "Dense"}], "backend": "tensorflow", "keras_version": "2.2.2", "class_name": "Sequential"}