{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"go_backwards": false, "recurrent_dropout": 0.0, "units": 50, "use_bias": true, "trainable": true, "return_sequences": true, "batch_input_shape": [null, 11, 1], "dtype": "float32", "recurrent_regularizer": null, "stateful": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "bias_constraint": null, "activation": "tanh", "activity_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "name": "lstm_1", "recurrent_constraint": null, "return_state": false, "bias_regularizer": null, "kernel_constraint": null, "recurrent_activation": "hard_sigmoid", "unit_forget_bias": true, "dropout": 0.0, "unroll": false, "implementation": 1}}, {"class_name": "LSTM", "config": {"go_backwards": false, "recurrent_dropout": 0.0, "units": 50, "use_bias": true, "trainable": true, "recurrent_regularizer": null, "stateful": false, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "bias_constraint": null, "activation": "tanh", "activity_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "implementation": 1, "name": "lstm_2", "recurrent_constraint": null, "return_state": false, "bias_regularizer": null, "kernel_constraint": null, "recurrent_activation": "hard_sigmoid", "unit_forget_bias": true, "dropout": 0.0, "unroll": false, "return_sequences": false}}, {"class_name": "Dense", "config": {"use_bias": true, "units": 1, "activation": "linear", "kernel_regularizer": null, "trainable": true, "name": "dense_1", "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null}}], "keras_version": "2.2.2"}