{"config": [{"config": {"trainable": true, "dtype": "float32", "bias_constraint": null, "return_state": false, "implementation": 1, "kernel_regularizer": null, "batch_input_shape": [null, 11, 1], "stateful": false, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "dropout": 0.0, "name": "lstm_1", "activation": "tanh", "return_sequences": true, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "units": 50, "recurrent_constraint": null, "unroll": false, "recurrent_dropout": 0.0, "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "go_backwards": false, "unit_forget_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}}, "class_name": "LSTM"}, {"config": {"bias_constraint": null, "return_state": false, "implementation": 1, "kernel_regularizer": null, "trainable": true, "stateful": false, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "dropout": 0.0, "name": "lstm_2", "activation": "tanh", "return_sequences": false, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "units": 50, "recurrent_constraint": null, "unroll": false, "recurrent_dropout": 0.0, "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "go_backwards": false, "unit_forget_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}}, "class_name": "LSTM"}, {"config": {"bias_constraint": null, "activity_regularizer": null, "units": 1, "activation": "linear", "kernel_regularizer": null, "trainable": true, "use_bias": true, "kernel_constraint": null, "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1"}, "class_name": "Dense"}], "keras_version": "2.2.2", "backend": "tensorflow", "class_name": "Sequential"}